In [1]:
import numpy as np
import pandas as pd

df2 = pd.read_excel('score.xlsx',encoding='UTF-8',index_col = 0,header=0,sheet_name='Sheet2')
df2.stack()

홍길동  수학     10
     과학    100
이순신  수학     30
     과학     80
강감찬  수학     20
     과학     30
권율   수학     90
     과학     40
dtype: int64

In [2]:
df2.unstack()

수학  홍길동     10
    이순신     30
    강감찬     20
    권율      90
과학  홍길동    100
    이순신     80
    강감찬     30
    권율      40
dtype: int64

In [13]:
df3 = pd.read_excel('score.xlsx',encoding='UTF-8',index_col = 0,header=[0,1],sheet_name='Sheet1')

In [18]:
df3.stack(level=0)

          과학   수학
홍길동 1학기  100   10
    2학기   30   20
이순신 1학기   80   30
    2학기   50   40
강감찬 1학기   30   20
    2학기   90   10
권율  1학기   40   90
    2학기   90  100

In [15]:
df3.stack(level=1)

        1학기  2학기
홍길동 과학  100   30
    수학   10   20
이순신 과학   80   50
    수학   30   40
강감찬 과학   30   90
    수학   20   10
권율  과학   40   90
    수학   90  100

In [16]:
df3.unstack()

1학기  수학  홍길동     10
         이순신     30
         강감찬     20
         권율      90
     과학  홍길동    100
         이순신     80
         강감찬     30
         권율      40
2학기  수학  홍길동     20
         이순신     40
         강감찬     10
         권율     100
     과학  홍길동     30
         이순신     50
         강감찬     90
         권율      90
dtype: int64

In [17]:
df3.stack(level=1).unstack()

     1학기     2학기
      과학  수학  과학   수학
홍길동  100  10  30   20
이순신   80  30  50   40
강감찬   30  20  90   10
권율    40  90  90  100